stress_tests/ab_test
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ping
Document Length:        4 bytes

Concurrency Level:      10
Time taken for tests:   12.114 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      715000 bytes
HTML transferred:       20000 bytes
Requests per second:    412.74 [#/sec] (mean)
Time per request:       24.229 [ms] (mean)
Time per request:       2.423 [ms] (mean, across all concurrent requests)
Transfer rate:          57.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      13
Processing:     1   24  17.9     20     208
Waiting:        1   24  17.7     19     208
Total:          2   24  17.9     20     208

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     26
  75%     32
  80%     35
  90%     46
  95%     58
  98%     73
  99%     84
 100%    208 (longest request)