stress_tests/ab_test
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ping
Document Length:        4 bytes

Concurrency Level:      1000
Time taken for tests:   4.341 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      715000 bytes
HTML transferred:       20000 bytes
Requests per second:    1151.93 [#/sec] (mean)
Time per request:       868.111 [ms] (mean)
Time per request:       0.868 [ms] (mean, across all concurrent requests)
Transfer rate:          160.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10  17.4      1      73
Processing:    28  787 315.6    754    2301
Waiting:       17  776 315.7    745    2300
Total:         91  797 310.9    771    2301

Percentage of the requests served within a certain time (ms)
  50%    771
  66%    877
  75%    961
  80%   1014
  90%   1204
  95%   1397
  98%   1560
  99%   1708
 100%   2301 (longest request)