stress_tests/ab_test
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ping
Document Length:        58 bytes

Concurrency Level:      1000
Time taken for tests:   0.946 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      960000 bytes
HTML transferred:       290000 bytes
Requests per second:    5284.81 [#/sec] (mean)
Time per request:       189.221 [ms] (mean)
Time per request:       0.189 [ms] (mean, across all concurrent requests)
Transfer rate:          990.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   25  17.6     21      73
Processing:    19  146  68.4    132     402
Waiting:        3  134  66.8    122     382
Total:         31  171  61.2    157     441

Percentage of the requests served within a certain time (ms)
  50%    157
  66%    178
  75%    207
  80%    234
  90%    270
  95%    289
  98%    307
  99%    313
 100%    441 (longest request)